{
  "rating": {
    "average": 4.9,
    "count": 13,
    "source": "Google"
  },
  "testimonials": [
    {
      "quote": "Die Zusammenarbeit mit der Noevu GmbH war durchweg positiv. Besonders hervorzuheben ist die schnelle Reaktionszeit – Anliegen wurden stets zügig und zuverlässig bearbeitet. Die Kommunikation war angenehm und unkompliziert, was die gesamte Zusammenarbeit sehr erleichtert hat.",
      "author": "Wohnperspektive GmbH",
      "company": "",
      "rating": 5,
      "date": "2025-07-01"
    },
    {
      "quote": "Noevu GmbH arbeitet talentiert, effizient und mit einem klaren Blick für durchdachte Lösungen. Die vielseitigen Kompetenzen mit modernen Web-CMS-Tools sind beeindruckend, und die Zusammenarbeit ist professionell, angenehm und zielführend. Besonders schätze ich den strukturierten Arbeitsstil, der technische Präzision mit einem stimmigen Verständnis für gutes Design verbindet.",
      "author": "Martin Künzi",
      "company": "",
      "rating": 5,
      "date": "2025-03-01"
    },
    {
      "quote": "Ein Profi durch und durch, sehr gutes Preis-Leistungsverhältnis! Wir sind mit dem Resultat äusserst zufrieden.",
      "author": "Reto Gerber",
      "company": "",
      "rating": 5,
      "date": "2025-03-01"
    },
    {
      "quote": "Die Qualität und das Preis-Leistungs-Verhältnis der Webdesigns von Noevu GmbH haben mich beeindruckt. Die erstellte Website überzeugt durch ihr ansprechendes Design, ihre Nutzerfreundlichkeit und ihre Optimierung für Suchmaschinen. Die professionelle Beratung und Unterstützung durch das gesamte Projekt waren herausragend.",
      "author": "Peter Hirning",
      "company": "",
      "rating": 5,
      "date": "2024-08-01"
    },
    {
      "quote": "Als selbstständige Senior SEO-Beraterin kann ich Noevu meinen eigenen Kunden bei Webentwicklungsbedarf sehr empfehlen. Noevu entwickelt schnell und verlässlich gute Web-Lösungen, die nicht nur optisch sehr ästhetisch daher kommen, sondern auch in ihrer Funktionalität herausstechen. Ein weiteres Plus ist das Hintergrundwissen von SEO.",
      "author": "Anabel Hafstad",
      "company": "Senior SEO-Beraterin",
      "rating": 5,
      "date": "2024-08-01"
    },
    {
      "quote": "Top-Webdesign-Agentur in Zürich. Die Noevu GmbH hat als Webdesign-Agentur meine Erwartungen übertroffen. Sie haben eine beeindruckende Website für mich entwickelt, die nicht nur optisch ein Highlight ist, sondern auch technisch perfekt umgesetzt wurde.",
      "author": "Dolores Libertas",
      "company": "",
      "rating": 5,
      "date": "2024-08-01"
    },
    {
      "quote": "Ich lernte die Noevu GmbH und den Geschäftsführer als äusserst kompetent und engagiert kennen. Die langjährige Erfahrung im Bereich digitaler Medien, breites Fachwissen und der Einsatz modernster Tools und Technologien führen zu herausragenden Ergebnissen.",
      "author": "Tobias Morf",
      "company": "",
      "rating": 5,
      "date": "2024-08-01"
    },
    {
      "quote": "Als Schweizer Werbesprecher bin ich auf eine top Webseite angewiesen. Noevu GmbH zeichnet sich durch eine ganzheitliche und strategische Beratung aus. Dabei zeigen sie sich nicht nur technisch versiert, sondern integrieren auch modernstes Webdesign in Ihre Konzepte.",
      "author": "Andy Zimmermann",
      "company": "Schweizer Werbesprecher",
      "rating": 5,
      "date": "2024-08-01"
    },
    {
      "quote": "Noevu hat uns hoch professionell, engagiert und termingerecht zu einer tollen neuen online Präsenz verholfen. Die Zusammenarbeit war jederzeit konstruktiv, die Beratung hervorragend.",
      "author": "Benedikt Vogel",
      "company": "",
      "rating": 5,
      "date": "2024-08-01"
    },
    {
      "quote": "Noel hat mir innert 10 Tagen einen super Webauftritt für mein Startup gemacht. Inhaltlich durchdacht und angenehm für die User-Journey, sinnvoll investiertes Geld.",
      "author": "Rebecca Mantel",
      "company": "EntdeckerBox",
      "rating": 5,
      "date": "2024-08-01"
    }
  ]
}
